---
kind: method
id: M:Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.GetExternalItems
source: html/f7781885-d8d2-61de-4610-67cf2fe9516e.htm
---
# Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.GetExternalItems Method

Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.

## Syntax (C#)
```csharp
public IDictionary<Guid, string> GetExternalItems()
```

## Returns
The external items which are displayed in the Transfer Project Standards UI.
 GUIDvalue is used to identify the external item string.